//Розроблена програма має опрацьовувати вже існуючий файл, створений за допомогою
//текстового редактора.
//Опрацювання файлів слід виконувати у функціях, які всю інформацію приймають у
//вигляді параметрів.Використовувати нелокальні змінні не можна.
//Кожна функція має виконувати лише одну роль, і ця роль має бути відображена у
//назві функції.
//«Функція, яка повертає / обчислює / шукає ...» – має не виводити ці значення, а
//повернути їх у місце виклику як результат функції або як відповідний вихідний параметр.

//Варіант 9.
//Дано текстовий файл t.
//Вияснити, чи є в цьому файлі четвірка сусідніх однакових символів(оформити у
//    вигляді функції).

#define _CRT_SECURE_NO_WARNINGS

#include <iostream>
#include <fstream>
#include<stdio.h>
#include <Windows.h>;

using namespace std;

int search();

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    cout << "Кількість однакової четвірки символів в файлі text.txt: " << search() << endl;
    return 0;
}
int search()
{
    FILE* t;
   
    fopen_s(&t, "text.txt", "r");

    char ch, ch1, ch2, ch3;

    if (t == 0)
    {
        cerr << "Помилка відкриття файлу!\n";
        exit(1);
    }
    else 
        ch = fgetc(t);
   
    int k = 0;

    int counter = 0;

    // зчитує символи вже відкритого файлу
    ch1 = fgetc(t);
    ch2 = fgetc(t);
    ch3 = fgetc(t);
    
    while (ch != EOF)
    {
        ch1 = fgetc(t);
        if (ch == ch1)
        {
            ch1 = fgetc(t);
            if (ch == ch1)
            {
                ch1 = fgetc(t);
                if(ch==ch1){
                    k += 1;
                }
            }
        }
        else
        {
            ch = fgetc(t);
        }
       
    }
    return k;
}

